app/Http/Resources/AuthUserResource.php

select * from "profiles" where "profiles"."id" in (2)
---
    public function __construct(User $user)
    {
        parent::__construct($user);
        $this->resource->load(['profile.media', 'roles']);