app/Listeners/CreateTicketChangeLogs.php

insert into "change_logs" ("data", "date", "initiatorId", "changableId", "changableType", "updated_at", "created_at") values ('{"property":"Description","oldValue":"Consectetur est rerum quasi nam vero. Dolorum non qui magni est odit. Unde veniam praesentium sapiente libero. Dolorem eveniet repellendus amet placeat dicta voluptatem.","newValue":"Consectetur est rerum quasi nam vero. Dolorum non qui magni est odit. Unde veniam praesentium sapiente libero. Dolorem eveniet repellendus amet placeat dicta voluptatem test."}', '2023-11-08 00:06:15', 1, 29, 'App\Models\Ticket', '2023-11-08 00:06:15', '2023-11-08 00:06:15') returning "id"
---
    public function handle(TicketUpdated $event)
    {
        DB::transaction(function () use ($event)
        {
            $event->newTicket->changeLogs()->createMany(
                $this->changeLogsData(
                    $event->oldTicket,
                    $event->newTicket,
                )
                    ->map(fn ($data) => [
                        'data' => $data,
                        'date' => $event->newTicket->updated_at,
                        'initiatorId' => $event->initiator->id,
                    ])
            );