app/Policies/TicketPolicy.php

select exists(select * from "tickets" where "tickets"."id" = 29) as "exists"
---
    public function show(User $user, Ticket $ticket)
    {
        return Ticket::query()
            ->canBeViewedBy($user)
            ->whereKey($ticket->id)
            ->exists();

select exists(select * from "tickets" where "tickets"."id" = 29) as "exists"
---
    public function update(User $user, Ticket $ticket)
    {
        return Ticket::query()
            ->canBeModifiedBy($user)
            ->whereKey($ticket->id)
            ->exists();

select exists(select * from "tickets" where "tickets"."id" = 29) as "exists"
---
    public function destroy(User $user, Ticket $ticket)
    {
        return Ticket::query()
            ->canBeDeletedBy($user)
            ->whereKey($ticket->id)
            ->exists();