app/Policies/TicketAssigneePolicy.php

    public function store(User $user, Ticket $ticket)
    {
        return Ticket::query()
            ->canBeAssignedBy($user)
            ->whereKey($ticket->id)
            ->exists();
---
select exists(select * from "tickets" where "tickets"."id" = 29) as "exists"