app/Http/Controllers/DashboardController.php

select count(*) as aggregate from "projects" where "status" = 0
select count(*) as aggregate from "tickets" where not exists (select * from "users" where "tickets"."assigneeId" = "users"."id")
select count(*) as aggregate from "tickets" where "created_at"::date >= '2023-10-31'
select count(*) as aggregate from "tickets" where "updated_at"::date >= '2023-10-31' and "status" = 4
select count(*) as aggregate from "tickets"
select count(*) as aggregate from "users" where "created_at"::date >= '2023-10-08'
select count(*) as aggregate from "users"
select "ticket_priorities".*, (select count(*) from "tickets" where "ticket_priorities"."id" = "tickets"."priorityId") as "tickets_count" from "ticket_priorities"
select status, count(id) as tickets_count from "tickets" group by "status"
select "ticket_types".*, (select count(*) from "tickets" where "ticket_types"."id" = "tickets"."typeId") as "tickets_count" from "ticket_types"
select "project_priorities".*, (select count(*) from "projects" where "project_priorities"."id" = "projects"."priorityId") as "projects_count" from "project_priorities"
---
    public function __invoke()
    {
        Gate::authorize('view-dashboard');

        return inertia('Dashboard', [
            'activeProjectsCount' => Project::where('status', ProjectStatus::Active)->count(),

            'unassignedTicketsCount' => Ticket::whereDoesntHave('assignee')->count(),

            'ticketsThisWeekCount' => Ticket::whereDate('created_at', '>=', now()->subWeek())->count(),

            'ticketsClosedThisWeekCount' => Ticket::whereDate('updated_at', '>=', now()->subWeek())
                ->where('status', TicketStatus::Closed)
                ->count(),

            'ticketsCount' => Ticket::count(),

            'usersRegisteredThisMonthCount' => User::whereDate('created_at', '>=', now()->subDays(30))->count(),

            'usersCount' => User::count(),

            'ticketPriorityChartData' => TicketPriority::withCount('tickets')->get()
                ->pipe(
                    fn ($ticketPriorityWithTicketCount) => [
                        'chartLabels' => $ticketPriorityWithTicketCount->pluck('name'),
                        'labelToColorMap' => $ticketPriorityWithTicketCount->pluck('color', 'name'),
                        'labelToDataMap' => $ticketPriorityWithTicketCount->pluck('tickets_count', 'name'),
                    ]
                ),

            'ticketStatusChartData' => [
                'chartLabels' => collect(TicketStatus::asArray())->keys(),
                'labelToDataMap' => Ticket::query()
                    ->selectRaw('status, count(id) as tickets_count')
                    ->groupBy('status')
                    ->get()
                    ->pluck('tickets_count', 'status')
                    ->mapWithKeys(
                        fn ($ticketsCount, $statusValue) => [
                            TicketStatus::fromValue($statusValue)->key => $ticketsCount
                        ]
                    )
                    ->pipe(
                        fn ($ticketsCounts) => collect(
                            TicketStatus::asArray()
                        )
                            ->map(fn ($ts) => 0)
                            ->merge($ticketsCounts)
                    ),
            ],

            'ticketTypeChartData' => TicketType::withCount('tickets')->get()
                ->pipe(fn ($ticketTypes) => [
                    'chartLabels' => $ticketTypes->pluck('name'),
                    'labelToColorMap' => $ticketTypes->pluck('color', 'name'),
                    'labelToDataMap' => $ticketTypes->pluck('tickets_count', 'name'),
                ]),

            'projectPriorityChartData' => ProjectPriority::withCount('projects')->get()
                ->pipe(fn ($projectPriorities) => [
                    'chartLabels' => $projectPriorities->pluck('name'),
                    'labelToColorMap' => $projectPriorities->pluck('color', 'name'),
                    'labelToDataMap' => $projectPriorities->pluck('projects_count', 'name'),
                ]),

select "projects".*, (select count(*) from "tickets" where "projects"."id" = "tickets"."projectId") as "tickets_count" from "projects"
---
                    ];
                }),

            'projectTicketChartData' => Project::query()
                ->withCount('tickets')
                ->get()
                ->pipe(function ($projectWithTickets)
                {
                    return [
                        'chartLabels' => $projectWithTickets->pluck('title'),
                        'labelToDataMap' => $projectWithTickets->pluck('tickets_count', 'title'),
                    ];
                }),