app/Http/Controllers/TicketAttachmentController.php

insert into "attachments" ("name", "notes", "attachableId", "attachableType", "uploaderId", "updated_at", "created_at") values ('test pdf', 'this is a test pdf', 29, 'App\Models\Ticket', 1, '2023-11-07 23:39:47', '2023-11-07 23:39:47') returning "id"
---
    public function store(StoreAttachmentRequest $request, Ticket $ticket)
    {
        Gate::authorize('store-ticket-attachment', [$ticket]);

        DB::transaction(function () use ($request, $ticket)
        {
            $attachment = $ticket->attachments()
                ->make([
                    'name' => $request->get('name'),
                    'notes' => $request->get('notes'),
                ]);

            $attachment->uploader()->associate($request->user());
            $attachment->save();