app/Http/Controllers/TicketController.php

    public function index(FilterTicketRequest $request)
    {
        Gate::authorize('view-all-ticket');

        return inertia('Tickets/Index', [
            'totalTicketCount' => fn () => Ticket::count(),

            'openOrReopendedTicketCount' => fn () => Ticket::query()
                ->whereIn('status', [TicketStatus::Open, TicketStatus::Reopended])
                ->count(),

            'unassignedTicketCount' => fn () => Ticket::query()
                ->whereDoesntHave('assignee')
                ->count(),

            'closedTicketCount' => fn () => Ticket::query()
                ->where('status', TicketStatus::Closed)
                ->count(),
---
select count(*) as aggregate from "tickets" where "status" in (0, 2)
select count(*) as aggregate from "tickets" where not exists (select * from "users" where "tickets"."assigneeId" = "users"."id")
select count(*) as aggregate from "tickets" where "status" = 4

                        function ($query, $searchQuery) use ($request)
                        {
                            $request->get('sortBy') ?
                                $query->search($searchQuery) :
                                $query->searchAndOrder($searchQuery);
                        }
                    )
                    ->when(
                        $request->get('filters'),
                        fn ($query, $filters) => $query->filter($filters)
                    )
                    ->when(
                        $request->get('sortBy'),
                        fn ($query, $sortBy) => $query->sort($sortBy),
                        fn ($query) => $query->orderBy('id', 'desc')
                    )
                    ->addSelect([
                        'can-view' => Ticket::from('tickets', 't')
                            ->canBeViewedBy($request->user())
                            ->whereColumn('tickets.id', 't.id')
                            ->select('id')
                            ->limit(1),
                        'can-edit' =>  Ticket::from('tickets', 't')
                            ->canBeModifiedBy($request->user())
                            ->whereColumn('tickets.id', 't.id')
                            ->select('id')
                            ->limit(1),
                        'can-delete' =>  Ticket::from('tickets', 't')
                            ->canBeDeletedBy($request->user())
                            ->whereColumn('tickets.id', 't.id')
                            ->select('id')
                            ->limit(1),
                        'can-assign' =>  Ticket::from('tickets', 't')
                            ->canBeAssignedBy($request->user())
                            ->whereColumn('tickets.id', 't.id')
                            ->select('id')
                            ->limit(1),
                    ])
                    ->withCasts([
                        'can-view' => 'boolean',
                        'can-edit' => 'boolean',
                        'can-delete' => 'boolean',
                        'can-assign' => 'boolean',
                    ])
                    ->paginate()
            ),

            'devs' => fn () => UserResource::collection(
                User::query()
                    ->with(['profile' => fn ($q) => $q->select('id', 'name')])
                    ->whereHas(
                        'roles',
                        fn ($q) => $q->where('name', UserRole::Dev)
                    )
                    ->select('id')
                    ->withForeignKeys()
                    ->get()
            ),

            'submitters' => fn () => UserResource::collection(
                User::query()
                    ->with(['profile' => fn ($q) => $q->select('id', 'name')])
                    ->select('id')
                    ->withForeignKeys()
                    ->get()
            ),

            'priorities' => fn () => TicketPriorityResource::collection(TicketPriority::all(['id', 'name'])),

            'types' => fn () => TicketTypeResource::collection(TicketType::all(['id', 'name'])),

            'projects' => fn () => ProjectResource::collection(
                Project::query()
                    ->canHaveTicketAddedBy($request->user())
                    ->select('id', 'title')
                    ->get()
            ),

            'projectsForFilter' => fn () => ProjectResource::collection(Project::all(['id', 'title'])),
---
select "tickets".*, (select "id" from "tickets" as "t" where "tickets"."id" = "t"."id" limit 1) as "can-view", (select "id" from "tickets" as "t" where "tickets"."id" = "t"."id" limit 1) as "can-edit", (select "id" from "tickets" as "t" where "tickets"."id" = "t"."id" limit 1) as "can-delete", (select "id" from "tickets" as "t" where "tickets"."id" = "t"."id" limit 1) as "can-assign" from "tickets" order by "id" desc limit 10 offset 0
select "id", "name" from "profiles" where "profiles"."id" in (6, 7, 8, 9, 10, 11, 12, 13)
select "id", "name" from "profiles" where "profiles"."id" in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
select "id", "name" from "ticket_priorities"
select "id", "name" from "ticket_types"
select "id", "title" from "projects"

                ])
            ),

            'attachments' => fn () => AttachmentResource::collection(
                $ticket->attachments()
                    ->with([
                        'media',
                        'uploader' => fn ($q1) => $q1->with(
                            ['profile' => fn ($q2) => $q2->select('id', 'name')]
                        )
                            ->select('id')
                            ->withForeignKeys(),
                    ])
                    ->orderBy('id', 'desc')
                    ->addSelect([
                        'can-view' => Attachment::from('attachments', 'a')
                            ->canBeViewedBy($request->user())
                            ->whereColumn('attachments.id', 'a.id')
                            ->select('id')
                            ->limit(1),
                        'can-delete' =>  Attachment::from('attachments', 'a')
                            ->canBeDeletedBy($request->user())
                            ->whereColumn('attachments.id', 'a.id')
                            ->select('id')
                            ->limit(1),
                    ])
                    ->withCasts([
                        'can-view' => 'boolean',
                        'can-delete' => 'boolean',
                    ])
                    ->paginate(null, ['*'], 'attachmentPage')
            ),

            'types' => fn () => TicketTypeResource::collection(TicketType::all(['id', 'name'])),

            'priorities' => fn () => TicketPriorityResource::collection(TicketPriority::all(['id', 'name'])),
---
select "id", "name" from "profiles" where "profiles"."id" in (7)
select "id", "name" from "profiles" where "profiles"."id" in (2, 17)
select "id", "name" from "ticket_types"
select "id", "name" from "ticket_priorities"

                    ->paginate(null, ['*'], 'ticketChangeLogPage'),
            ),

            'ticketModifiers' => fn () => UserResource::collection(
                User::query()
                    ->canModifyTicket($ticket)
                    ->with(['profile' => fn ($q) => $q->select('id', 'name')])
                    ->get()
            ),
---
select "id", "name" from "profiles" where "profiles"."id" in (3, 7, 15)

    public function update(UpdateTicketRequest $request, Ticket $ticket)
    {
        Gate::authorize('update-ticket', [$ticket]);

        if ($request->has('assignee'))
            Gate::authorize('store-ticket-assignee', [$ticket]);

        $ticket->fill([
            'title' => $request->get('title'),
            'description' => $request->get('description'),
            'status' => TicketStatus::fromKey($request->get('status'))->value,
        ]);

        $ticket->priority()->associate($request->get('priority'));
        $ticket->type()->associate($request->get('type'));

        if ($request->has('assignee'))
            $ticket->assignee()->associate($request->get('assignee'));

        $ticket->save();
---
update "tickets" set "description" = 'Consectetur est rerum quasi nam vero. Dolorum non qui magni est odit. Unde veniam praesentium sapiente libero. Dolorem eveniet repellendus amet placeat dicta voluptatem test.', "updated_at" = '2023-11-08 00:06:15' where "id" = 29