app/Providers/FortifyServiceProvider.php

select * from "users" where "email" = 'demo-admin' or "username" = 'demo-admin' limit 1
---
                public function toResponse($request)
                {
                    return redirect()->intended(
                        RouteServiceProvider::defaultRedirect(
                            $request->user()
                        )
                    );
                }
            }
        );

        Fortify::authenticateUsing(function (Request $request)
        {
            $user = User::query()
                ->where('email', $request->email)
                ->orWhere('username', $request->email)
                ->first();